const obj = {
    code: 0,
    message: 'ok',
    data: {
        title: '日落大道 - 我喜欢的音乐',
        title1: '日落大道',
        author: '梁博',
        duration: '04:35',
        pic: 'https://p1.music.126.net/LaqoquOfDZnlrsEj22kehw==/109951164387670165.jpg?imageView=1&type=webp&thumbnail=84x0',
        pic1: 'https://p1.music.126.net/bkBg46eD1bS9D2mzxnKAnQ==/3395291910036707.jpg?param=130y130',
        pic2: 'http://p1.music.126.net/vmCcDvD1H04e9gm97xsCqg==/109951163350929740.jpg?imageView&thumbnail=50y50&quality=15&tostatic=0',
        audio: './obj_w5rDlsOJwrLDjj7CmsOj_28481786960_ef64_c1c0_be88_f27c670bd938e467a778d7a15d2de26f.m4a',
        lyric: '[00:00.00] 作词 : 梁博\n[00:01.00] 作曲 : 梁博\n[00:04.53]\n[00:15.60]总是梦见云层之上飞过子午线\n[00:21.72]\n[00:23.09]分不清是黑夜还是白天\n[00:27.51]\n[00:30.39]带着装不下的期待匆匆的赶来\n[00:37.12]我再想一遍想一遍\n[00:42.60]\n[00:44.06]我们寻找着在这条路的中间\n[00:48.44]我们迷失着在这条路的两端\n[00:52.16]每当黄昏阳光把所有都渲染\n[00:55.97]你看那金黄多耀眼\n[00:59.79]我们奔跑着在这条路的中间\n[01:03.56]我们哭泣着在这条路的两端\n[01:07.32]每当黄昏阳光把所有都渲染\n[01:11.08]我看到夜的黑暗\n[01:15.62]晚风吹过金色沙滩海边的晚宴\n[01:23.22]那种味道现在还不习惯\n[01:27.85]\n[01:30.56]拉斯维加斯往返的路上我看见\n[01:37.17]这里无人烟无人烟\n[01:43.09]\n[01:44.46]我们寻找着在这条路的中间\n[01:48.47]我们迷失着在这条路的两端\n[01:52.31]每当黄昏阳光把所有都渲染\n[01:55.92]你看那金黄多耀眼\n[01:59.66]我们奔跑着在这条路的中间\n[02:03.45]我们哭泣着在这条路的两端\n[02:07.21]每当黄昏阳光把所有都渲染\n[02:10.91]我看到夜的黑暗\n[02:15.98]\n[02:45.01]奔跑着在这条路的中间\n[02:48.96]\n[02:52.67]哭泣着在这条路的两端\n[02:56.06]\n[02:59.27]每当黄昏阳光把所有都渲染\n[03:03.49]\n[03:06.99]我看到夜的黑暗\n'
    }
}

const API = {
    queryLyric() {
        return new Promise(resolve => {
            setTimeout(
                () => {
                    resolve(obj)
                },
                Math.round(Math.random() * (2000 - 500) + 500)
            )
        })
    }
}